Ezachka/STM32H743VI/STM32H743/Libraries/stm32h7xx_usart.c

#include "stm32h7xx_usart.h"
#include "stm32h7xx_rcc.h"
#include "stm32h7xx_gpio.h"
#include "gpio_config.h"

void usart_gpio_init ( USART_TypeDef* USART_x );
uint32_t usart_clock_config ( USART_TypeDef* USART_x );


//@TODO не доделаны фунции USART6 UART7 UART8



ErrorStatus usart_init ( USART_TypeDef* USART_x, uint32_t baund_rate,usart_parity_mode_t parity,usart_swap_pin_t swap)
{
	float temp = 0.0f;
	uint32_t brr = 0x00;
	uint32_t bus_freq = 0x00;
    
	bus_freq=usart_clock_config (USART_x);
    if(bus_freq==ERROR)
    {
        return ERROR;
    }
    
    
	usart_gpio_init ( USART_x );
	
	
	/**** USART bound rate setting ****/
    if(USART_x == LPUART1){
        /*!< Fcl must range from 3 x baud rate to 4096 x baud rate*/
        /*!< if Fcl=16MHz -> 4800baud >= baund_rate <= 4000Kbaud  */
        /*!< if Fcl=170MHz -> 57600baud >= baund_rate   */
        temp = (float)bus_freq * 256.0f/ (float)baund_rate;
        brr  = (uint32_t) temp;
    }
    else{
        temp = (float)bus_freq / (float)baund_rate / 16.0f;
        brr  = ((uint32_t)temp<<4) | ((uint32_t)( (temp-(uint16_t)temp)*16) );
    }
    
	USART_x->BRR = brr;
    
	/**** USART register setting ****/
    USART_x->CR1 &= ~USART_CR1_FIFOEN;  //Fifo mode disable
    
	USART_x->CR1 &= ~USART_CR1_OVER8;	//Oversampling by 16
	USART_x->CR1 &= ~USART_CR1_M;		//Word length 8 bits
	USART_x->CR1 &= ~USART_CR1_WAKE;	//Wakeup method: Idle Line 
	USART_x->CR1 &= ~USART_CR1_TXEIE;	//TXE interrupt inhibited
	USART_x->CR1 &= ~USART_CR1_TCIE;	//Transmission complete interrupt inhibited
	USART_x->CR1 |=  USART_CR1_RXNEIE;	//RXNE interrupt enable
	USART_x->CR1 &= ~USART_CR1_IDLEIE;	//IDLE interrupt inhibited
	USART_x->CR1 |=  USART_CR1_TE;		//Transmitter enable
	USART_x->CR1 |=  USART_CR1_RE;		//Receiver enable
	USART_x->CR1 &= ~USART_CR1_UESM;	//USART disable in low-power mode
	
	USART_x->CR2 &= ~(USART_CR2_STOP);	// 1 Stop bit
    
    if(parity==none_parity)
    {
        USART_x->CR1 &= ~USART_CR1_PCE;		//Parity control disable
    }
    else // ODD or even
    {
        USART_x->CR1 |= (0x01<<USART_CR1_M_Pos);		//Word length 9 bits to one more even
        USART_x->CR1 |= USART_CR1_PCE;		            //Parity control enable
        USART_x->CR1 |= (parity<<USART_CR1_PS_Pos);		//Parity control enable
    }
    if(swap)
    {
        USART_x->CR2 |= USART_CR2_SWAP;      //swap TX-RX pins 
    }
    
	USART_x->CR1 |= USART_CR1_UE;		//USART enable
    
	if( USART_x == USART1 ){
		NVIC_EnableIRQ(USART1_IRQn);
        NVIC_SetPriority( USART1_IRQn, 2);
	}
	else if( USART_x == USART2 ){
		NVIC_EnableIRQ(USART2_IRQn);
	}
	else if( USART_x == USART3 ){
		NVIC_EnableIRQ(USART3_IRQn);
	}
	else if( USART_x == UART4 ){
		NVIC_EnableIRQ(UART4_IRQn);
	}
	else if( USART_x == UART5 ){
		NVIC_EnableIRQ(UART5_IRQn);
	}
    else if( USART_x == USART6 ){
		NVIC_EnableIRQ(USART6_IRQn);
	}
    else if( USART_x == UART7 ){
		NVIC_EnableIRQ(UART7_IRQn);
	}
    else if( USART_x == UART8 ){
		NVIC_EnableIRQ(UART8_IRQn);
	}
	else if( USART_x == LPUART1 ){
		NVIC_EnableIRQ(LPUART1_IRQn);
	}
    return SUCCESS;
}

void usart_transmit_byte ( USART_TypeDef* USART_x, void *data )
{
	uint8_t* data_tx;
	data_tx = data;
	
	while (!(USART_x->ISR & USART_ISR_TXE_TXFNF));
	USART_x->TDR = *data_tx;
}

void usart_transmit ( USART_TypeDef* USART_x, void *data_buff, uint16_t data_len )
{
	uint8_t* data_tx;
	data_tx = data_buff;
	
	for( uint16_t i=0; i<data_len; i++ ){
		while (!(USART_x->ISR & USART_ISR_TXE_TXFNF));
		USART_x->TDR = (uint8_t) data_tx[i];
	}
}

uint8_t usart_receive ( USART_TypeDef* USART_x )
{
	return (uint8_t)( USART_x->RDR );
}


volatile uint8_t 	usart1_tx_buf[ SCB_TX_BUFF_LEN ];
const uint8_t 	    usart1_tx_buf_size = SCB_TX_BUFF_LEN - 1;
volatile uint8_t 	usart1_tx_buf_len = 0;
uint8_t				usart1_tx_buf_p;

volatile uint8_t 	usart1_rx_buf[ SCB_RX_BUFF_LEN ];
const uint8_t 		usart1_rx_buf_size = SCB_RX_BUFF_LEN - 1;
volatile uint8_t 	usart1_rx_buf_len = 0;
uint8_t				usart1_rx_buf_p;

uint8_t	usart1_receive_byte_last;
uint8_t	usart1_read_byte_last;
uint8_t	usart1_error_count;    

void usart_1_irq_handler ( void )
{
    // byte received
    if( USART1->ISR & USART_ISR_RXNE_RXFNE )
    {
        usart1_receive_byte_last = (USART1->RDR) & 0xFF;
        if( usart1_rx_buf_len < usart1_rx_buf_size ) 
        {
            usart1_rx_buf[ usart1_rx_buf_len ] = usart1_receive_byte_last;
            usart1_rx_buf_len += 1;
        }
        //        return;
    }
    
    //byte transmited
    if( USART1->ISR & USART_ISR_TXE_TXFNF )
    {
        if( (usart1_tx_buf_len - usart1_tx_buf_p) > 0 )
        {
            USART1->TDR = usart1_tx_buf[ usart1_tx_buf_p ] & 0xFF;
            
            usart1_tx_buf_p += 1;
        }
        
        if( (usart1_tx_buf_len - usart1_tx_buf_p) == 0 )
        {
            usart1_tx_buf_len = 0;
            usart1_tx_buf_p = 0;
            
            USART1->CR1 &= ~USART_CR1_TXEIE; //stop writing operations
        }
        //        return;
    }
    
    //Errors check
    if ( !(USART1->ISR & (USART_ISR_ORE|USART_ICR_NECF|USART_ISR_FE|USART_ISR_PE|USART_ISR_UDR)) )
        return;
    
    //Overrun error detected
    if( USART1->ISR & USART_ISR_ORE ){
        USART1->ICR |= ( USART_ICR_ORECF );	
        usart1_error_count++;   
    }
    // Noise error in multibuffer communication detected
    if( USART1->ISR & USART_ISR_NE ){
        USART1->ICR |= ( USART_ICR_NECF );
        usart1_error_count++;
    }
    // Framing Error in multibuffer communication detected
    if( USART1->ISR & USART_ISR_FE ){
        USART1->ICR |= ( USART_ICR_FECF );
        usart1_error_count++;
    }
    // Parity error detected
    if( USART1->ISR & USART_ISR_PE ){  
        USART1->ICR |= ( USART_ICR_PECF );
        usart1_error_count++;
    }
    // SPI slave underrun error detected
    if(USART1->ISR & USART_ISR_UDR){
        USART1->ICR |= ( USART_ICR_UDRCF );	
        usart1_error_count++;
    }
}

volatile uint8_t 	usart2_tx_buf[ SCB_TX_BUFF_LEN ];
const uint8_t 	    usart2_tx_buf_size = SCB_TX_BUFF_LEN - 1;
volatile uint8_t 	usart2_tx_buf_len = 0;
uint8_t				usart2_tx_buf_p;

volatile uint8_t 	usart2_rx_buf[ SCB_RX_BUFF_LEN ];
const uint8_t 		usart2_rx_buf_size = SCB_RX_BUFF_LEN - 1;
volatile uint8_t 	usart2_rx_buf_len = 0;
uint8_t				usart2_rx_buf_p;

uint8_t	usart2_receive_byte_last;
uint8_t	usart2_read_byte_last;
uint8_t	usart2_error_count;    

void usart_2_irq_handler ( void )
{
    // byte received
    if( USART2->ISR & USART_ISR_RXNE_RXFNE )
    {
        usart2_receive_byte_last = (USART2->RDR) & 0xFF;
        if( usart2_rx_buf_len < usart2_rx_buf_size ) 
        {
            usart2_rx_buf[ usart2_rx_buf_len ] = usart2_receive_byte_last;
            usart2_rx_buf_len += 1;
        }
        //        return;
    }
    
    //byte transmited
    if( USART2->ISR & USART_ISR_TXE_TXFNF )
    {
        if( (usart2_tx_buf_len - usart2_tx_buf_p) > 0 )
        {
            USART2->TDR = usart2_tx_buf[ usart2_tx_buf_p ] & 0xFF;
            
