Ezachka/STM32H743VI/STM32H743/Libraries/stm32h7xx_usart.c
            usart2_tx_buf_p += 1;
        }
        
        if( (usart2_tx_buf_len - usart2_tx_buf_p) == 0 )
        {
            usart2_tx_buf_len = 0;
            usart2_tx_buf_p = 0;
            
            USART2->CR1 &= ~USART_CR1_TXEIE; //stop writing operations
        }
        //        return;
    }
    
    //Errors check
    if ( !(USART2->ISR & (USART_ISR_ORE|USART_ICR_NECF|USART_ISR_FE|USART_ISR_PE|USART_ISR_UDR)) )
        return;
    
    //Overrun error detected
    if( USART2->ISR & USART_ISR_ORE ){
        USART2->ICR |= ( USART_ICR_ORECF );	
        usart2_error_count++;   
    }
    // Noise error in multibuffer communication detected
    if( USART2->ISR & USART_ISR_NE ){
        USART2->ICR |= ( USART_ICR_NECF );
        usart2_error_count++;
    }
    // Framing Error in multibuffer communication detected
    if( USART2->ISR & USART_ISR_FE ){
        USART2->ICR |= ( USART_ICR_FECF );
        usart2_error_count++;
    }
    // Parity error detected
    if( USART2->ISR & USART_ISR_PE ){
        USART2->ICR |= ( USART_ICR_PECF );
        usart2_error_count++;
    }
    // SPI slave underrun error detected
    if(USART2->ISR & USART_ISR_UDR){
        USART2->ICR |= ( USART_ICR_UDRCF );	
        usart2_error_count++;
    }
}

volatile uint8_t 	usart3_tx_buf[ SCB_TX_BUFF_LEN ];
const uint8_t 	    usart3_tx_buf_size = SCB_TX_BUFF_LEN - 1;
volatile uint8_t 	usart3_tx_buf_len = 0;
uint8_t				usart3_tx_buf_p;

volatile uint8_t 	usart3_rx_buf[ SCB_RX_BUFF_LEN ];
const uint8_t 		usart3_rx_buf_size = SCB_RX_BUFF_LEN - 1;
volatile uint8_t 	usart3_rx_buf_len = 0;
uint8_t				usart3_rx_buf_p;

uint8_t	usart3_receive_byte_last;
uint8_t	usart3_read_byte_last;
uint8_t	usart3_error_count;    

void usart_3_irq_handler ( void )
{
    // byte received
    if( USART3->ISR & USART_ISR_RXNE_RXFNE )
    {
        usart3_receive_byte_last = (USART3->RDR) & 0xFF;
        if( usart3_rx_buf_len < usart3_rx_buf_size ) 
        {
            usart3_rx_buf[ usart3_rx_buf_len ] = usart3_receive_byte_last;
            usart3_rx_buf_len += 1;
        }
        //        return;
    }
    
    //byte transmited
    if( USART3->ISR & USART_ISR_TXE_TXFNF )
    {
        if( (usart3_tx_buf_len - usart3_tx_buf_p) > 0 )
        {
            USART3->TDR = usart3_tx_buf[ usart3_tx_buf_p ] & 0xFF;
            
            usart3_tx_buf_p += 1;
        }
        
        if( (usart3_tx_buf_len - usart3_tx_buf_p) == 0 )
        {
            usart3_tx_buf_len = 0;
            usart3_tx_buf_p = 0;
            
            USART3->CR1 &= ~USART_CR1_TXEIE; //stop writing operations
        }
        //        return;
    }
    
    //Errors check
    if ( !(USART3->ISR & (USART_ISR_ORE|USART_ICR_NECF|USART_ISR_FE|USART_ISR_PE|USART_ISR_UDR)) )
        return;
    
    //Overrun error detected
    if( USART3->ISR & USART_ISR_ORE ){
        USART3->ICR |= ( USART_ICR_ORECF );	
        usart3_error_count++;   
    }
    // Noise error in multibuffer communication detected
    if( USART3->ISR & USART_ISR_NE ){
        USART3->ICR |= ( USART_ICR_NECF );
        usart3_error_count++;
    }
    // Framing Error in multibuffer communication detected
    if( USART3->ISR & USART_ISR_FE ){
        USART3->ICR |= ( USART_ICR_FECF );
        usart3_error_count++;
    }
    // Parity error detected
    if( USART3->ISR & USART_ISR_PE ){
        USART3->ICR |= ( USART_ICR_PECF );
        usart3_error_count++;
    }
    // SPI slave underrun error detected
    if(USART3->ISR & USART_ISR_UDR){
        USART3->ICR |= ( USART_ICR_UDRCF );	
        usart3_error_count++;
    }
}

volatile uint8_t 	uart4_tx_buf[ SCB_TX_BUFF_LEN ];
const uint8_t 	    uart4_tx_buf_size = SCB_TX_BUFF_LEN - 1;
volatile uint8_t 	uart4_tx_buf_len = 0;
uint8_t				uart4_tx_buf_p;

volatile uint8_t 	uart4_rx_buf[ SCB_RX_BUFF_LEN ];
const uint8_t 		uart4_rx_buf_size = SCB_RX_BUFF_LEN - 1;
volatile uint8_t 	uart4_rx_buf_len = 0;
uint8_t				uart4_rx_buf_p;

uint8_t	uart4_receive_byte_last;
uint8_t	uart4_read_byte_last;
uint8_t	uart4_error_count;    

void uart_4_irq_handler ( void )
{
    // byte received
    if( UART4->ISR & USART_ISR_RXNE_RXFNE )
    {
        uart4_receive_byte_last = (UART4->RDR) & 0xFF;
        if( uart4_rx_buf_len < uart4_rx_buf_size ) 
        {
            uart4_rx_buf[ uart4_rx_buf_len ] = uart4_receive_byte_last;
            uart4_rx_buf_len += 1;
        }
        //        return;
    }
    
    //byte transmited
    if( UART4->ISR & USART_ISR_TXE_TXFNF )
    {
        if( (uart4_tx_buf_len - uart4_tx_buf_p) > 0 )
        {
            UART4->TDR = uart4_tx_buf[ uart4_tx_buf_p ] & 0xFF;
            
            uart4_tx_buf_p += 1;
        }
        
        if( (uart4_tx_buf_len - uart4_tx_buf_p) == 0 )
        {
            uart4_tx_buf_len = 0;
            uart4_tx_buf_p = 0;
            
            UART4->CR1 &= ~USART_CR1_TXEIE; //stop writing operations
        }
        //        return;
    }
    
    //Errors check
    if ( !(UART4->ISR & (USART_ISR_ORE|USART_ICR_NECF|USART_ISR_FE|USART_ISR_PE|USART_ISR_UDR)) )
        return;
    
    //Overrun error detected
    if( UART4->ISR & USART_ISR_ORE ){
        UART4->ICR |= ( USART_ICR_ORECF );	
        uart4_error_count++;   
    }
    // Noise error in multibuffer communication detected
    if( UART4->ISR & USART_ISR_NE ){
        UART4->ICR |= ( USART_ICR_NECF );
        uart4_error_count++;
    }
    // Framing Error in multibuffer communication detected
    if( UART4->ISR & USART_ISR_FE ){
        UART4->ICR |= ( USART_ICR_FECF );
        uart4_error_count++;
    }
    // Parity error detected
    if( UART4->ISR & USART_ISR_PE ){
        UART4->ICR |= ( USART_ICR_PECF );
        uart4_error_count++;
    }
    // SPI slave underrun error detected
    if(UART4->ISR & USART_ISR_UDR){
        UART4->ICR |= ( USART_ICR_UDRCF );	
        uart4_error_count++;
    }
}

volatile uint8_t 	uart5_tx_buf[ SCB_TX_BUFF_LEN ];
const uint8_t 	    uart5_tx_buf_size = SCB_TX_BUFF_LEN - 1;
volatile uint8_t 	uart5_tx_buf_len = 0;
uint8_t				uart5_tx_buf_p;

volatile uint8_t 	uart5_rx_buf[ SCB_RX_BUFF_LEN ];
const uint8_t 		uart5_rx_buf_size = SCB_RX_BUFF_LEN - 1;
volatile uint8_t 	uart5_rx_buf_len = 0;
uint8_t				uart5_rx_buf_p;

uint8_t	uart5_receive_byte_last;
uint8_t	uart5_read_byte_last;
uint8_t	uart5_error_count;    

void uart_5_irq_handler ( void )
{
    // byte received
    if( UART5->ISR & USART_ISR_RXNE_RXFNE )
    {
        uart5_receive_byte_last = (UART5->RDR) & 0xFF;
        if( uart5_rx_buf_len < uart5_rx_buf_size ) 
        {
            uart5_rx_buf[ uart5_rx_buf_len ] = uart5_receive_byte_last;
            uart5_rx_buf_len += 1;
        }
        //        return;
    }
    
    //byte transmited
    if( UART5->ISR & USART_ISR_TXE_TXFNF )
    {
        if( (uart5_tx_buf_len - uart5_tx_buf_p) > 0 )
        {
            UART5->TDR = uart5_tx_buf[ uart5_tx_buf_p ] & 0xFF;
            
            uart5_tx_buf_p += 1;
        }
        
        if( (uart5_tx_buf_len - uart5_tx_buf_p) == 0 )
        {
            uart5_tx_buf_len = 0;
            uart5_tx_buf_p = 0;
            
            UART5->CR1 &= ~USART_CR1_TXEIE; //stop writing operations
        }
        //        return;
    }
    
