Ezachka/STM32H743VI/STM32H743/Libraries/stm32h7xx_usart.c
    //Errors check
    if ( !(UART5->ISR & (USART_ISR_ORE|USART_ICR_NECF|USART_ISR_FE|USART_ISR_PE|USART_ISR_UDR)) )
        return;
    
    //Overrun error detected
    if( UART5->ISR & USART_ISR_ORE ){
        UART5->ICR |= ( USART_ICR_ORECF );	
        uart5_error_count++;   
    }
    // Noise error in multibuffer communication detected
    if( UART5->ISR & USART_ISR_NE ){
        UART5->ICR |= ( USART_ICR_NECF );
        uart5_error_count++;
    }
    // Framing Error in multibuffer communication detected
    if( UART5->ISR & USART_ISR_FE ){
        UART5->ICR |= ( USART_ICR_FECF );
        uart5_error_count++;
    }
    // Parity error detected
    if( UART5->ISR & USART_ISR_PE ){
        UART5->ICR |= ( USART_ICR_PECF );
        uart5_error_count++;
    }
    // SPI slave underrun error detected
    if(UART5->ISR & USART_ISR_UDR){
        UART5->ICR |= ( USART_ICR_UDRCF );	
        uart5_error_count++;
    }
}

volatile uint8_t 	lpuart1_tx_buf[ SCB_TX_BUFF_LEN ];
const uint8_t 	    lpuart1_tx_buf_size = SCB_TX_BUFF_LEN - 1;
volatile uint8_t 	lpuart1_tx_buf_len = 0;
uint8_t				lpuart1_tx_buf_p;

volatile uint8_t 	lpuart1_rx_buf[ SCB_RX_BUFF_LEN ];
const uint8_t 		lpuart1_rx_buf_size = SCB_RX_BUFF_LEN - 1;
volatile uint8_t 	lpuart1_rx_buf_len = 0;
uint8_t				lpuart1_rx_buf_p;

uint8_t	lpuart1_receive_byte_last;
uint8_t	lpuart1_read_byte_last;
uint8_t	lpuart1_error_count;    

void lpuart_1_irq_handler ( void )
{
    // byte received
    if( LPUART1->ISR & USART_ISR_RXNE_RXFNE )
    {
        lpuart1_receive_byte_last = (LPUART1->RDR) & 0xFF;
        if( lpuart1_rx_buf_len < lpuart1_rx_buf_size ) 
        {
            lpuart1_rx_buf[ lpuart1_rx_buf_len ] = lpuart1_receive_byte_last;
            lpuart1_rx_buf_len += 1;
        }
        //        return;
    }
    
    //byte transmited
    if( LPUART1->ISR & USART_ISR_TXE_TXFNF )
    {
        if( (lpuart1_tx_buf_len - lpuart1_tx_buf_p) > 0 )
        {
            LPUART1->TDR = lpuart1_tx_buf[ lpuart1_tx_buf_p ] & 0xFF;
            
            lpuart1_tx_buf_p += 1;
        }
        
        if( (lpuart1_tx_buf_len - lpuart1_tx_buf_p) == 0 )
        {
            lpuart1_tx_buf_len = 0;
            lpuart1_tx_buf_p = 0;
            
            LPUART1->CR1 &= ~USART_CR1_TXEIE; //stop writing operations
        }
        //        return;
    }
    
    //Errors check
    if ( !(LPUART1->ISR & (USART_ISR_ORE|USART_ICR_NECF|USART_ISR_FE|USART_ISR_PE|USART_ISR_UDR)) )
        return;
    
    //Overrun error detected
    if( LPUART1->ISR & USART_ISR_ORE ){
        LPUART1->ICR |= ( USART_ICR_ORECF );	
        lpuart1_error_count++;   
    }
    // Noise error in multibuffer communication detected
    if( LPUART1->ISR & USART_ISR_NE ){
        LPUART1->ICR |= ( USART_ICR_NECF );
        lpuart1_error_count++;
    }
    // Framing Error in multibuffer communication detected
    if( LPUART1->ISR & USART_ISR_FE ){
        LPUART1->ICR |= ( USART_ICR_FECF );
        lpuart1_error_count++;
    }
    // Parity error detected
    if( LPUART1->ISR & USART_ISR_PE ){
        LPUART1->ICR |= ( USART_ICR_PECF );
        lpuart1_error_count++;
    }
    // SPI slave underrun error detected
    if(LPUART1->ISR & USART_ISR_UDR){
        LPUART1->ICR |= ( USART_ICR_UDRCF );	
        lpuart1_error_count++;
    }
}

uint8_t uart_read_available( USART_TypeDef* USART_x )
{
    if( USART_x == USART1 ){
		return usart1_rx_buf_len - usart1_rx_buf_p;
	}
	else if( USART_x == USART2 ){
		return usart2_rx_buf_len - usart2_rx_buf_p;
	}
	else if( USART_x == USART3 ){
		return usart3_rx_buf_len - usart3_rx_buf_p;
	}
	else if( USART_x == UART4 ){
		return uart4_rx_buf_len - uart4_rx_buf_p;
	}
	else if( USART_x == UART5 ){
		return uart5_rx_buf_len - uart5_rx_buf_p;
	}
	else if( USART_x == LPUART1 ){
		return lpuart1_rx_buf_len - lpuart1_rx_buf_p;
	}  
    return 0;   
}

uint8_t usart_read_byte( USART_TypeDef* USART_x )
{
    if( USART_x == USART1 ){
        if( usart1_rx_buf_len > 0 ){
            usart1_read_byte_last = usart1_rx_buf[ usart1_rx_buf_p ];
            usart1_rx_buf_p += 1;
            
            if( usart1_rx_buf_p == usart1_rx_buf_len ){
                usart1_rx_buf_len = 0;
                usart1_rx_buf_p = 0;
            }
            
            return usart1_read_byte_last;
        }
	}
	else if( USART_x == USART2 ){
        if( usart2_rx_buf_len > 0 ){
            usart2_read_byte_last = usart2_rx_buf[ usart2_rx_buf_p ];
            usart2_rx_buf_p += 1;
            
            if( usart2_rx_buf_p == usart2_rx_buf_len ){
                usart2_rx_buf_len = 0;
                usart2_rx_buf_p = 0;
            }
            
            return usart2_read_byte_last;
        }
	}
	else if( USART_x == USART3 ){
        if( usart3_rx_buf_len > 0 ){
            usart3_read_byte_last = usart3_rx_buf[ usart3_rx_buf_p ];
            usart3_rx_buf_p += 1;
            
            if( usart3_rx_buf_p == usart3_rx_buf_len ){
                usart3_rx_buf_len = 0;
                usart3_rx_buf_p = 0;
            }
            
            return usart3_read_byte_last;
        }
	}
	else if( USART_x == UART4 ){
        if( uart4_rx_buf_len > 0 ){
            uart4_read_byte_last = uart4_rx_buf[ uart4_rx_buf_p ];
            uart4_rx_buf_p += 1;
            
            if( uart4_rx_buf_p == uart4_rx_buf_len ){
                uart4_rx_buf_len = 0;
                uart4_rx_buf_p = 0;
            }
            
            return uart4_read_byte_last;
        }
	}
	else if( USART_x == UART5 ){
        if( uart5_rx_buf_len > 0 ){
            uart5_read_byte_last = uart5_rx_buf[ uart5_rx_buf_p ];
            uart5_rx_buf_p += 1;
            
            if( uart5_rx_buf_p == uart5_rx_buf_len ){
                uart5_rx_buf_len = 0;
                uart5_rx_buf_p = 0;
            }
            
            return uart5_read_byte_last;
        }
	}
	else if( USART_x == LPUART1 ){
        if( lpuart1_rx_buf_len > 0 ){
            lpuart1_read_byte_last = lpuart1_rx_buf[ lpuart1_rx_buf_p ];
            lpuart1_rx_buf_p += 1;
            
            if( lpuart1_rx_buf_p == lpuart1_rx_buf_len ){
                lpuart1_rx_buf_len = 0;
                lpuart1_rx_buf_p = 0;
            }
            
            return lpuart1_read_byte_last;
        }
        
