Ezachka/STM32H743VI/STM32H743/Libraries/stm32h7xx_usart.c
	}  
    return 0;
}

void usart_send_byte( USART_TypeDef* USART_x, uint8_t byte )
{
    if( USART_x == USART1 ){
        if( usart1_tx_buf_len < usart1_tx_buf_size ){
            usart1_tx_buf[ usart1_tx_buf_len ] = byte;
            usart1_tx_buf_len += 1;
            
            USART1->CR1 |= USART_CR1_TXEIE;
        }	
	}
	else if( USART_x == USART2 ){
        if( usart2_tx_buf_len < usart2_tx_buf_size ){
            usart2_tx_buf[ usart2_tx_buf_len ] = byte;
            usart2_tx_buf_len += 1;
            
            USART2->CR1 |= USART_CR1_TXEIE;
        }			
	}
	else if( USART_x == USART3 ){
        if( usart3_tx_buf_len < usart3_tx_buf_size ){
            usart3_tx_buf[ usart3_tx_buf_len ] = byte;
            usart3_tx_buf_len += 1;
            
            USART3->CR1 |= USART_CR1_TXEIE;
        }			
	}
	else if( USART_x == UART4 ){
        if( uart4_tx_buf_len < uart4_tx_buf_size ){
            uart4_tx_buf[ uart4_tx_buf_len ] = byte;
            uart4_tx_buf_len += 1;
            
            UART4->CR1 |= USART_CR1_TXEIE;
        }	
	}
	else if( USART_x == UART5 ){
        if( uart5_tx_buf_len < uart5_tx_buf_size ){
            uart5_tx_buf[ uart5_tx_buf_len ] = byte;
            uart5_tx_buf_len += 1;
            
            UART5->CR1 |= USART_CR1_TXEIE;
        }	
	}
	else if( USART_x == LPUART1 ){
        if( lpuart1_tx_buf_len < lpuart1_tx_buf_size ){
            lpuart1_tx_buf[ lpuart1_tx_buf_len ] = byte;
            lpuart1_tx_buf_len += 1;
            
            LPUART1->CR1 |= USART_CR1_TXEIE;
        }	
	}       
}

void usart_send_data( USART_TypeDef* USART_x, uint8_t* data, uint8_t size )
{
    if( USART_x == USART1 ){
        for( uint8_t i = 0; i < size; i++ ){
            if( usart1_tx_buf_len < usart1_tx_buf_size ){
                usart1_tx_buf[ usart1_tx_buf_len ] = data[i];
                usart1_tx_buf_len += 1;
            }
        }
        if( usart1_tx_buf_len>0 ){
            USART1->CR1 |= USART_CR1_TXEIE;
        }
	}
	else if( USART_x == USART2 ){
        for( uint8_t i = 0; i < size; i++ ){
            if( usart2_tx_buf_len < usart2_tx_buf_size ){
                usart2_tx_buf[ usart2_tx_buf_len ] = data[i];
                usart2_tx_buf_len += 1;
            }
        }
        if( usart2_tx_buf_len>0 ){
            USART2->CR1 |= USART_CR1_TXEIE;
        }
	}
	else if( USART_x == USART3 ){
        for( uint8_t i = 0; i < size; i++ ){
            if( usart3_tx_buf_len < usart3_tx_buf_size ){
                usart3_tx_buf[ usart3_tx_buf_len ] = data[i];
                usart3_tx_buf_len += 1;
            }
        }
        if( usart3_tx_buf_len>0 ){
            USART3->CR1 |= USART_CR1_TXEIE;
        }
	}
	else if( USART_x == UART4 ){
        for( uint8_t i = 0; i < size; i++ ){
            if( uart4_tx_buf_len < uart4_tx_buf_size ){
                uart4_tx_buf[ uart4_tx_buf_len ] = data[i];
                uart4_tx_buf_len += 1;
            }
        }
        if( uart4_tx_buf_len>0 ){
            UART4->CR1 |= USART_CR1_TXEIE;
        }
	}
	else if( USART_x == UART5 ){
        for( uint8_t i = 0; i < size; i++ ){
            if( uart5_tx_buf_len < uart5_tx_buf_size ){
                uart5_tx_buf[ uart5_tx_buf_len ] = data[i];
                uart5_tx_buf_len += 1;
            }
        }
        if( uart5_tx_buf_len>0 ){
            UART5->CR1 |= USART_CR1_TXEIE;
        }
	}
	else if( USART_x == LPUART1 ){
        for( uint8_t i = 0; i < size; i++ ){
            if( lpuart1_tx_buf_len < lpuart1_tx_buf_size ){
                lpuart1_tx_buf[ lpuart1_tx_buf_len ] = data[i];
                lpuart1_tx_buf_len += 1;
            }
        }
        if( lpuart1_tx_buf_len>0 ){
            LPUART1->CR1 |= USART_CR1_TXEIE;
        }
	}    
}

void usart_clear_tx_buf(  USART_TypeDef* USART_x )
{
    if( USART_x == USART1 ){
        usart1_tx_buf_len = 0;
        usart1_tx_buf_p = 0;
	}
	else if( USART_x == USART2 ){
        usart2_tx_buf_len = 0;
        usart2_tx_buf_p = 0;
	}
	else if( USART_x == USART3 ){
        usart3_tx_buf_len = 0;
        usart3_tx_buf_p = 0;
	}
	else if( USART_x == UART4 ){
        uart4_tx_buf_len = 0;
        uart4_tx_buf_p = 0;
	}
	else if( USART_x == UART5 ){
        uart5_tx_buf_len = 0;
        uart5_tx_buf_p = 0;
	}
	else if( USART_x == LPUART1 ){
        lpuart1_tx_buf_len = 0;
        lpuart1_tx_buf_p = 0;
	}      
}

void usart_clear_rx_buf( USART_TypeDef* USART_x )
{
    if( USART_x == USART1 ){
        usart1_rx_buf_len = 0;
        usart1_rx_buf_p = 0;
	}
	else if( USART_x == USART2 ){
        usart2_rx_buf_len = 0;
        usart2_rx_buf_p = 0;
	}
	else if( USART_x == USART3 ){
        usart3_rx_buf_len = 0;
        usart3_rx_buf_p = 0;
	}
	else if( USART_x == UART4 ){
        uart4_rx_buf_len = 0;
        uart4_rx_buf_p = 0;
	}
	else if( USART_x == UART5 ){
        uart5_rx_buf_len = 0;
        uart5_rx_buf_p = 0;
	}
	else if( USART_x == LPUART1 ){
        lpuart1_rx_buf_len = 0;
        lpuart1_rx_buf_p = 0;
	}     
}

void usart_gpio_init ( USART_TypeDef* USART_x )
{
    /* GPIO configuration struct */
    gpio_configuration_t gpio_config;
  	/**** USART gpio setting ****/
	if( USART_x == USART1 ){
        //USART_1_TX PB6 
        gpio_config.port     = USART_1_TX_PORT;
        gpio_config.pin      = USART_1_TX_PIN;
        gpio_config.mode     = gpio_af;
        gpio_config.speed    = very_high_speed;
        gpio_config.otype    = gpio_otype_pp;
        gpio_config.pupd     = gpio_pupd_up;
        gpio_configuration ( &gpio_config );
        USART_1_TX_PORT->AFR[0] |= (0x07 << GPIO_AFRL_AFSEL6_Pos); //AF = 7 (USART_1_TX)
        
        //USART_1_RX PB7 
        gpio_config.port     = USART_1_RX_PORT;
        gpio_config.pin      = USART_1_RX_PIN;
        gpio_config.mode     = gpio_af;
        gpio_config.speed    = very_high_speed;
        gpio_config.otype    = gpio_otype_pp;
        gpio_config.pupd     = gpio_pupd_nopull;
        gpio_configuration ( &gpio_config );
        USART_1_RX_PORT->AFR[0] |= (0x07 << GPIO_AFRL_AFSEL7_Pos); //AF = 7 (USART_1_RX)    
	}
	else if( USART_x == USART2 ){
        //        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOAEN;
        //	  
        //	  	//PA2 - TX
        //		GPIOA->MODER 	&= ~(GPIO_MODER_MODER2);		//MODER clear
        //		GPIOA->MODER 	|=  (GPIO_MODER_MODER2_1);		//AF
        //		GPIOA->OTYPER 	&= ~(GPIO_OTYPER_OT_2);			//PushPull
        //		GPIOA->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR2);	//MAX_speed
        //		GPIOA->PUPDR 	&= ~(GPIO_PUPDR_PUPDR2);		//PUPDR clear
        //		GPIOA->PUPDR 	|=  (GPIO_PUPDR_PUPDR2_0);		//Pull Up 
        //        GPIOA->AFR[0] 	&= ~(GPIO_AFRL_AFSEL2_Msk);     //AF clear
        //		GPIOA->AFR[0] 	|=  (GPIO_AFRL_AFSEL2_2|GPIO_AFRL_AFSEL2_1|GPIO_AFRL_AFSEL2_0); //AF = 7 (USART2)
        //        
        //		//PA3 - RX
        //		GPIOA->MODER 	&= ~(GPIO_MODER_MODER3);		//MODER clear
        //		GPIOA->MODER 	|=  (GPIO_MODER_MODER3_1);		//AF
        //		GPIOA->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR3);	//MAX_speed
        //		GPIOA->PUPDR 	&= ~(GPIO_PUPDR_PUPDR3);		//PUPDR clear
        //        GPIOA->AFR[0] 	&= ~(GPIO_AFRL_AFSEL3_Msk);     //AF clear
        //        GPIOA->AFR[0] 	|=  (GPIO_AFRL_AFSEL3_2|GPIO_AFRL_AFSEL3_1|GPIO_AFRL_AFSEL3_0); //AF = 7 (USART2)
	}
	else if( USART_x == USART3 ){
        //        RCC->AHB2ENR |= RCC_AHB2ENR_GPIODEN;
        //	  
        //	  	//PD8 - TX
        //		GPIOD->MODER 	&= ~(GPIO_MODER_MODER8);		//MODER clear
        //		GPIOD->MODER 	|=  (GPIO_MODER_MODER8_1);		//AF
        //		GPIOD->OTYPER 	&= ~(GPIO_OTYPER_OT_8);			//PushPull
        //		GPIOD->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR8);	//MAX_speed
        //		GPIOD->PUPDR 	&= ~(GPIO_PUPDR_PUPDR8);		//PUPDR clear
        //		GPIOD->PUPDR 	|=  (GPIO_PUPDR_PUPDR8_0);		//Pull Up 
        //        GPIOD->AFR[1] 	&= ~(GPIO_AFRH_AFSEL8_Msk);     //AF clear
        //		GPIOD->AFR[1] 	|=  (GPIO_AFRH_AFSEL8_2|GPIO_AFRH_AFSEL8_1|GPIO_AFRH_AFSEL8_0); //AF = 7 (USART3)
        //        
        //		//PD9 - RX
        //		GPIOD->MODER 	&= ~(GPIO_MODER_MODER9);		//MODER clear
        //		GPIOD->MODER 	|=  (GPIO_MODER_MODER9_1);		//AF
        //		GPIOD->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR9);	//MAX_speed
        //		GPIOD->PUPDR 	&= ~(GPIO_PUPDR_PUPDR9);		//PUPDR clear
        //        GPIOD->AFR[1] 	&= ~(GPIO_AFRH_AFSEL9_Msk);     //AF clear
        //        GPIOD->AFR[1] 	|=  (GPIO_AFRH_AFSEL9_2|GPIO_AFRH_AFSEL9_1|GPIO_AFRH_AFSEL9_0); //AF = 7 (USART3)
	}
	else if( USART_x == UART4 ){
        //        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOCEN;
        //        
        //        //PC10 - TX
        //		GPIOC->MODER 	&= ~(GPIO_MODER_MODER10);		//MODER clear
        //		GPIOC->MODER 	|=  (GPIO_MODER_MODER10_1);		//AF
        //		GPIOC->OTYPER 	&= ~(GPIO_OTYPER_OT_10);	    //PushPull
        //		GPIOC->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR10);	//MAX_speed
        //		GPIOC->PUPDR 	&= ~(GPIO_PUPDR_PUPDR10);		//PUPDR clear
        //		GPIOC->PUPDR 	|=  (GPIO_PUPDR_PUPDR10_1);		//Pull Up 
        //		GPIOC->AFR[1] 	&= ~(GPIO_AFRH_AFSEL10_Msk);    //AF clear
        //        GPIOC->AFR[1] 	|=  (GPIO_AFRH_AFSEL10_2 | GPIO_AFRH_AFSEL10_0);    //AF = 5 (UART4)
        //        
        //		//PC11 - RX
        //		GPIOC->MODER 	&= ~(GPIO_MODER_MODER11);		//MODER clear
        //		GPIOC->MODER 	|=  (GPIO_MODER_MODER11_1);		//AF
        //		GPIOC->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR11);	//MAX_speed
        //		GPIOC->PUPDR 	&= ~(GPIO_PUPDR_PUPDR11);		//PUPDR clear
        //        GPIOC->AFR[1] 	&= ~(GPIO_AFRH_AFSEL11_Msk);    //AF clear
        //        GPIOC->AFR[1] 	|=  (GPIO_AFRH_AFSEL11_2 | GPIO_AFRH_AFSEL11_0);    //AF = 5 (UART4)	
	}
	else if( USART_x == UART5 ){
        //        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOCEN;
        //        RCC->AHB2ENR |= RCC_AHB2ENR_GPIODEN;
        //        
        //        //PC12 - TX
        //		GPIOC->MODER 	&= ~(GPIO_MODER_MODER12);		//MODER clear
        //		GPIOC->MODER 	|=  (GPIO_MODER_MODER12_1);		//AF
        //		GPIOC->OTYPER 	&= ~(GPIO_OTYPER_OT_12);	    //PushPull
        //		GPIOC->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR12);	//MAX_speed
        //		GPIOC->PUPDR 	&= ~(GPIO_PUPDR_PUPDR12);		//PUPDR clear
        //		GPIOC->PUPDR 	|=  (GPIO_PUPDR_PUPDR12_1);		//Pull Up 
        //		GPIOC->AFR[1] 	&= ~(GPIO_AFRH_AFSEL12_Msk);    //AF clear
        //        GPIOC->AFR[1] 	|=  (GPIO_AFRH_AFSEL12_2 | GPIO_AFRH_AFSEL12_0);    //AF = 5 (UART5)
        //        
        //		//PD2 - RX
        //		GPIOD->MODER 	&= ~(GPIO_MODER_MODER2);		//MODER clear
        //		GPIOD->MODER 	|=  (GPIO_MODER_MODER2_1);		//AF
        //		GPIOD->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR2);	//MAX_speed
        //		GPIOD->PUPDR 	&= ~(GPIO_PUPDR_PUPDR2);		//PUPDR clear
        //        GPIOD->AFR[0] 	&= ~(GPIO_AFRL_AFSEL2_Msk);     //AF clear
        //        GPIOD->AFR[0] 	|=  (GPIO_AFRL_AFSEL2_2 | GPIO_AFRL_AFSEL2_0);    //AF = 5 (UART5)
	}
	else if( USART_x == LPUART1 ){
        //        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOBEN;
        //        
        //        //PB11 - TX
        //		GPIOB->MODER 	&= ~(GPIO_MODER_MODER11);		//MODER clear
        //		GPIOB->MODER 	|=  (GPIO_MODER_MODER11_1);		//AF
        //		GPIOB->OTYPER 	&= ~(GPIO_OTYPER_OT_11);	    //PushPull
        //		GPIOB->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR11);	//MAX_speed
        //		GPIOB->PUPDR 	&= ~(GPIO_PUPDR_PUPDR11);		//PUPDR clear
        //		GPIOB->PUPDR 	|=  (GPIO_PUPDR_PUPDR11_1);		//Pull Up 
        //		GPIOB->AFR[1] 	&= ~(GPIO_AFRH_AFSEL11_Msk);    //AF clear
        //        GPIOB->AFR[1] 	|=  (GPIO_AFRH_AFSEL11_3);      //AF = 8 (LPUART1)
        //        
        //		//PB10 - RX
        //		GPIOB->MODER 	&= ~(GPIO_MODER_MODER10);		//MODER clear
        //		GPIOB->MODER 	|=  (GPIO_MODER_MODER10_1);		//AF
        //		GPIOB->OSPEEDR 	|=  (GPIO_OSPEEDER_OSPEEDR10);	//MAX_speed
        //		GPIOB->PUPDR 	&= ~(GPIO_PUPDR_PUPDR10);		//PUPDR clear
        //        GPIOB->AFR[1] 	&= ~(GPIO_AFRH_AFSEL10_Msk);    //AF clear
        //        GPIOB->AFR[1] 	|=  (GPIO_AFRH_AFSEL10_3);      //AF = 8 (LPUART1)
	}
}

uint32_t usart_clock_config ( USART_TypeDef* USART_x )
{
    uint32_t bus_freq = 0x00;
    /**** USART clocking setting ****/
	if( USART_x == USART1 ){
		RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
        
        switch ( RCC->D2CCIP2R &  RCC_D2CCIP2R_USART16SEL_Msk ){
            case 0x00: bus_freq = rcc_clocks.bus_freq.apb_2;      break;
            case 0x01:     break;
            case 0x02:     break;
            case 0x03: bus_freq = rcc_clocks.source_val.hsi;       break;
            case 0x04:     break;
            case 0x05: bus_freq = rcc_clocks.source_val.lse;       break;
            default:  return ERROR; break;
        }
        return bus_freq;
	}
	else if( USART_x == USART2 ){
		RCC->APB1LENR |= RCC_APB1LENR_USART2EN;
        
        switch ( RCC->D2CCIP2R &  RCC_D2CCIP2R_USART28SEL_Msk ){
            case 0x00: bus_freq = rcc_clocks.bus_freq.apb_1;      break;
            case 0x01:     break;
            case 0x02:     break;
            case 0x03: bus_freq = rcc_clocks.source_val.hsi;       break;
            case 0x04:        break;
            case 0x05: bus_freq = rcc_clocks.source_val.lse;       break;
            default:  return ERROR; break;
        }
        return bus_freq;
	}
	else if( USART_x == USART3 ){
		RCC->APB1LENR |= RCC_APB1LENR_USART3EN;
        switch ( RCC->D2CCIP2R &  RCC_D2CCIP2R_USART28SEL_Msk ){
            case 0x00: bus_freq = rcc_clocks.bus_freq.apb_1;      break;
            case 0x01:     break;
            case 0x02:     break;
            case 0x03: bus_freq = rcc_clocks.source_val.hsi;       break;
            case 0x04:        break;
            case 0x05: bus_freq = rcc_clocks.source_val.lse;       break;
            default:  return ERROR; break;
        }
        return bus_freq;
	}
	else if( USART_x == UART4 ){
		RCC->APB1LENR |= RCC_APB1LENR_UART4EN;
        switch ( RCC->D2CCIP2R &  RCC_D2CCIP2R_USART28SEL_Msk ){
            case 0x00: bus_freq = rcc_clocks.bus_freq.apb_1;      break;
            case 0x01:     break;
            case 0x02:     break;
            case 0x03: bus_freq = rcc_clocks.source_val.hsi;       break;
            case 0x04:        break;
            case 0x05: bus_freq = rcc_clocks.source_val.lse;       break;
            default:  return ERROR; break;
        }
        return bus_freq;
	}
	else if( USART_x == UART5 ){
		RCC->APB1LENR |= RCC_APB1LENR_UART5EN;
        switch ( RCC->D2CCIP2R &  RCC_D2CCIP2R_USART28SEL_Msk ){
            case 0x00: bus_freq = rcc_clocks.bus_freq.apb_1;      break;
            case 0x01:     break;
            case 0x02:     break;
            case 0x03: bus_freq = rcc_clocks.source_val.hsi;       break;
            case 0x04:        break;
            case 0x05: bus_freq = rcc_clocks.source_val.lse;       break;
            default:  return ERROR; break;
        }
        return bus_freq;
	}
    else if( USART_x == USART6 ){
		RCC->APB2ENR |= RCC_APB2ENR_USART6EN;
        
        switch ( RCC->D2CCIP2R &  RCC_D2CCIP2R_USART16SEL_Msk ){
            case 0x00: bus_freq = rcc_clocks.bus_freq.apb_2;      break;
            case 0x01:     break;
            case 0x02:     break;
            case 0x03: bus_freq = rcc_clocks.source_val.hsi;       break;
            case 0x04:     break;
            case 0x05: bus_freq = rcc_clocks.source_val.lse;       break;
            default:  return ERROR; break;
        }
        return bus_freq;
    }
    else if( USART_x == UART7 ){
		RCC->APB1LENR |= RCC_APB1LENR_UART7EN;
        switch ( RCC->D2CCIP2R &  RCC_D2CCIP2R_USART28SEL_Msk ){
            case 0x00: bus_freq = rcc_clocks.bus_freq.apb_1;      break;
            case 0x01:     break;
            case 0x02:     break;
            case 0x03: bus_freq = rcc_clocks.source_val.hsi;       break;
            case 0x04:        break;
            case 0x05: bus_freq = rcc_clocks.source_val.lse;       break;
            default:  return ERROR; break;
        }
        return bus_freq;
	}
    else if( USART_x == UART8 ){
		RCC->APB1LENR |= RCC_APB1LENR_UART8EN;
        switch ( RCC->D2CCIP2R &  RCC_D2CCIP2R_USART28SEL_Msk ){
            case 0x00: bus_freq = rcc_clocks.bus_freq.apb_1;      break;
            case 0x01:     break;
            case 0x02:     break;
            case 0x03: bus_freq = rcc_clocks.source_val.hsi;       break;
            case 0x04:        break;
            case 0x05: bus_freq = rcc_clocks.source_val.lse;       break;
            default:  return ERROR; break;
        }
        return bus_freq;
	}

    return ERROR;
}
